Koryphon/msp430lib/modules/clock_sys_internal.h
/*
* Copyright (c) 2012, Alexander I. Mykyta
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright notice, this
*    list of conditions and the following disclaimer.
* 2. Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

/**
* \addtogroup MOD_CLOCKSYS
* \{
**/

/**
* \file
* \brief Internal include for \ref MOD_CLOCKSYS "Clock System".
* \author Alex Mykyta
**/

///\}

#ifndef CLOCK_SYS_INTERNAL_H_
#define CLOCK_SYS_INTERNAL_H_

//##################################################################################################
//# Basic Clock Module                                                                             #
//# 1xx Devices                                                                                    #
//##################################################################################################
#ifdef __MSP430_HAS_BASIC_CLOCK__
#error "Clock System not implemented yet"
#endif

//##################################################################################################
//# Basic Clock Module+                                                                            #
//# 2xx Devices                                                                                    #
//##################################################################################################
#ifdef __MSP430_HAS_BC2__
#error "Clock System not implemented yet"
#endif

//##################################################################################################
//# FLL+ Clock Module                                                                              #
//# 4xx Devices                                                                                    #
//##################################################################################################
/* Notes:
 *     - ACLK is always from XT1 or VLO
 *  - SMCLK is only from the DCO or XT2
 *  - MCLK can get XT1, XT2, VLO or DCO... sometimes
 *
 * only 41x2 has a VLO. XT1 can't be used at the same time.
 *         #ifdef LF1XT1S_2
 *
 * 41x and 42x do not have an XT2
 *         #ifdef XT2OFF
 *
 * 41x and 42x do not have SELM except for 41x2
 *         MCLK is always from the DCO
 *         #ifdef SELM0
 *
 * 47x3/4, 471xx have an XT2S setting for XT2
 *         #ifdef XT2S_0
 *
 */
#ifdef __MSP430_HAS_FLLPLUS__

// check for incorrect routing settings
#if(ACLK_SRC == 1) // XT1
#elif(ACLK_SRC == 3) // VLO
#ifndef LF1XT1S_2 // if doesn't have a VLO
#error Invalid ACLK_SRC: This device does not have a VLO
#endif
#else
#error Invalid ACLK_SRC
#endif

#if(SMCLK_SRC == 0) // DCO
#elif(SMCLK_SRC == 2) // XT2
#ifndef XT2OFF // if doesn't have an XT2
#error Invalid SMCLK_SRC: This device does not have an XT2
#endif
#else
#error Invalid SMCLK_SRC
#endif

#if(MCLK_SRC == 0) // DCO
#elif(MCLK_SRC == 1) // XT1
#ifndef SELM0
#error Invalid MCLK_SRC
#endif
#elif(MCLK_SRC == 2) // XT2
#ifndef XT2OFF // if doesn't have an XT2
#error Invalid MCLK_SRC: This device does not have an XT2
#else
#ifndef SELM0
#error Invalid MCLK_SRC
#endif
#endif
#elif(MCLK_SRC == 3) // VLO
#ifndef LF1XT1S_2 // if doesn't have a VLO
#error Invalid MCLK_SRC: This device does not have a VLO
#else
#ifndef SELM0
#error Invalid MCLK_SRC
#endif
#endif
#else
#error Invalid MCLK_SRC
#endif



// what sources are being used?
// DCO
#if((SMCLK_SRC == 0)||(MCLK_SRC == 0))
#define _USING_DCO
#endif

// XT1
#if((ACLK_SRC == 1)||(MCLK_SRC == 1)||(defined(_USING_DCO) && (FLL_REF_SRC == 0)))
#define _USING_XT1
#endif

// XT2
#if((SMCLK_SRC == 2)||(MCLK_SRC == 2))
#define _USING_XT2
#endif

// VLO
#if((ACLK_SRC == 3)||(MCLK_SRC == 3)||(defined(_USING_DCO) && (FLL_REF_SRC == 2)))
#ifndef _USING_XT1
#define _USING_VLO
#else
#error XT1 and VLO cant be used at the same time.
#endif
#endif


/*--------------------------------------------------------------------------------------------------
*  DCO & FLL Setup:
*
*  Resulting Definitions:
*     FLL_FN
*     FLL_FLLD
*     FLL_N
*
*     DCO_FREQ
*/
#ifdef _USING_DCO
// DCO always uses DCOPLUS=1

#ifdef _USING_XT1
#define FLL_REF_FREQ    XT1_FREQ
#else
#define FLL_REF_FREQ    12000L
#endif

#if(MANUALLY_CONFIG_DCO)
#if(MANUAL_FLLPLUS_N > 127)
#error Invalid MANUAL_FLLPLUS_N
#endif

#if(MANUAL_FLLPLUS_FLLD > 3)
#error Invalid MANUAL_FLLPLUS_FLLD
#endif

#define FLL_FLLD    (MANUAL_FLLPLUS_FLLD << 6)
#define FLL_N        MANUAL_FLLPLUS_N
#define DCO_FREQ    (FLL_REF_FREQ*(FLL_N+1)*(1<<MANUAL_FLLPLUS_FLLD))
#else
#if(((TARGET_DCO_FREQ/(FLL_REF_FREQ*1))-1) <= 127)
#define FLL_FLLD    FLLD_1
#define FLL_N        ((TARGET_DCO_FREQ/(FLL_REF_FREQ*1))-1)
#define DCO_FREQ    (FLL_REF_FREQ*(FLL_N+1)*1)
#elif(((TARGET_DCO_FREQ/(FLL_REF_FREQ*2))-1) <= 127)
#define FLL_FLLD    FLLD_2
#define FLL_N        ((TARGET_DCO_FREQ/(FLL_REF_FREQ*2))-1)
#define DCO_FREQ    (FLL_REF_FREQ*(FLL_N+1)*2)
#elif(((TARGET_DCO_FREQ/(FLL_REF_FREQ*4))-1) <= 127)
#define FLL_FLLD    FLLD_4
#define FLL_N        ((TARGET_DCO_FREQ/(FLL_REF_FREQ*4))-1)
#define DCO_FREQ    (FLL_REF_FREQ*(FLL_N+1)*4)
#elif(((TARGET_DCO_FREQ/(FLL_REF_FREQ*8))-1) <= 127)
#define FLL_FLLD    FLLD_8
#define FLL_N        ((TARGET_DCO_FREQ/(FLL_REF_FREQ*8))-1)
#define DCO_FREQ    (FLL_REF_FREQ*(FLL_N+1)*8)
#else
#error TARGET_DCO_FREQ is outside of the feasible range 
#endif
#endif

#if((DCO_FREQ >= 650000L) && (DCO_FREQ < 2820000))
#define FLL_FN    0        // 0.65 - 6.1 MHz
#elif((DCO_FREQ >= 2820000L) && (DCO_FREQ < 4920000L))
#define FLL_FN    FN_2    // 1.3 - 12.1 MHz
#elif((DCO_FREQ >= 4920000L) && (DCO_FREQ < 7080000L))
#define FLL_FN    FN_3    // 2.0 - 17.9 MHz
#elif((DCO_FREQ >= 7080000L) && (DCO_FREQ < 10570000L))
#define FLL_FN    FN_4    // 2.8 - 26.6 MHz
#elif((DCO_FREQ >= 10570000L) && (DCO_FREQ < 46000000L))
#define FLL_FN    FN_8    // 4.2 - 46.0 MHz
#else
#error Resulting DCO frequency is outside of the FLLs range 
#endif
#endif


