Koryphon/msp430lib/modules/clock_sys_internal.h
// ACLK
#if (ACLK_SRC == 1) // XT1
#define        _ACLK_FREQ        XT1_FREQ
#elif (ACLK_SRC == 3) // VLO
#define        _ACLK_FREQ        12000L
#else
#error "Invalid ACLK_SRC"
#endif

// SMCLK
#if (SMCLK_SRC == 0) // DCO
#define        _SMCLK_FREQ        DCO_FREQ
#elif (SMCLK_SRC == 2) // XT2
#define        _SMCLK_FREQ        XT2_FREQ
#else
#error "Invalid SMCLK_SRC"
#endif

// MCLK
#if (MCLK_SRC == 0) // DCO
#define        _MCLK_FREQ        DCO_FREQ
#elif (MCLK_SRC == 1) // XT1
#define        _MCLK_FREQ        XT1_FREQ
#elif (MCLK_SRC == 2) // XT2
#define        _MCLK_FREQ        XT2_FREQ
#elif (MCLK_SRC == 3) // VLO
#define        _MCLK_FREQ        12000L
#else
#error "Invalid MCLK_SRC"
#endif



#endif

//##################################################################################################
//# Unified Clock System (UCS)                                                                     #
//# 5xx and 6xx Devices                                                                            #
//##################################################################################################
#ifdef __MSP430_HAS_UCS__

#if (XT1_FREQ != 0)
#define _HAS_XT1
#endif

#if (XT2_FREQ != 0)
#define _HAS_XT2
#endif

#if ((ACLK_SRC == 0)||(SMCLK_SRC == 0)||(MCLK_SRC == 0))
#define _USING_DCO
#endif

#if ((ACLK_SRC == 1)||(SMCLK_SRC == 1)||(MCLK_SRC == 1))
#ifdef _HAS_XT1
#define _USING_XT1
#else
#error "XT1 Is not available!"
#endif
#endif

#if ((ACLK_SRC == 2)||(SMCLK_SRC == 2)||(MCLK_SRC == 2))
#ifdef _HAS_XT2
#define _USING_XT2
#else
#error "XT2 Is not available!"
#endif
#endif

/*--------------------------------------------------------------------------------------------------
*  UCS DCO & FLL Setup:
*
*  Resulting Definitions:
*     FLL_FLLREFDIV
*     FLL_SELREF
*     FLL_FLLD
*     FLL_FLLN
*
*     DCO_FREQ
*/
#ifdef _USING_DCO
#if(FLL_REF_SRC == 0)
// XT1
#ifdef _HAS_XT1
#define FLL_SELREF    SELREF__XT1CLK
#define _USING_XT1
#define FLL_REF_FREQ    XT1_FREQ
#else
#error "Invalid FLL_REF_SRC"
#endif
#elif(FLL_REF_SRC == 1)
// XT2
#ifdef _HAS_XT2
#define FLL_SELREF    SELREF__XT2CLK
#define _USING_XT2
#define FLL_REF_FREQ    XT2_FREQ
#else
#error "Invalid FLL_REF_SRC"
#endif
#elif(FLL_REF_SRC == 3)
// REFO
#define FLL_SELREF    SELREF__REFOCLK
#define FLL_REF_FREQ    (32768L)
#else
#error "Invalid FLL_REF_SRC"
#endif

#if(MANUALLY_CONFIG_DCO == 0)

#define _CALC_FLLN(rd, ld)    (((rd)*TARGET_DCO_FREQ)/(FLL_REF_FREQ*(ld))-1)
#define _CALC_FREQ(rd, ld)    (((ld)*(_CALC_FLLN(rd, ld)+1)*FLL_REF_FREQ)/(rd))

#if(_CALC_FLLN(16, 1) == 0)
#error Desired target DCO frequency is out of feasible range!
#endif

#if(_CALC_FLLN(16, 1) <= 511)
#if(_CALC_FREQ(16,1) > TARGET_DCO_FREQ)
#define FRQ_ERROR    (_CALC_FREQ(16,1) - TARGET_DCO_FREQ)
#else
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(16,1))
#endif
#else
#define FRQ_ERROR    TARGET_DCO_FREQ
#endif

// Try REFDIV=12, FLLD=1
#ifndef FLL_FLLD
#if(_CALC_FLLN(12, 1) <= 511)
#if(_CALC_FREQ(12,1) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(12,1) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(16,1)
#define FLL_FLLREFDIV    FLLREFDIV__16
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(16,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(12,1) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(12,1))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(16,1)
#define FLL_FLLREFDIV    FLLREFDIV__16
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(16,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(12,1))
#endif
#endif
#endif
#endif

// Try REFDIV=8, FLLD=1
#ifndef FLL_FLLD
#if(_CALC_FLLN(8, 1) <= 511)
#if(_CALC_FREQ(8,1) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(8,1) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,1)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(12,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(8,1) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(8,1))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,1)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(12,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(8,1))
#endif
#endif
#endif
#endif

// Try REFDIV=12, FLLD=2
#ifndef FLL_FLLD
#if(_CALC_FLLN(12, 2) <= 511)
#if(_CALC_FREQ(12,2) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(12,2) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(8,1)
#define FLL_FLLREFDIV    FLLREFDIV__8
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(8,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(12,2) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(12,2))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(8,1)
#define FLL_FLLREFDIV    FLLREFDIV__8
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(8,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(12,2))
#endif
#endif
#endif
#endif

// Try REFDIV=4, FLLD=1
#ifndef FLL_FLLD
#if(_CALC_FLLN(4, 1) <= 511)
#if(_CALC_FREQ(4,1) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(4,1) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,2)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__2
#define DCO_FREQ        _CALC_FREQ(12,2)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(4,1) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(4,1))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,2)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__2
#define DCO_FREQ        _CALC_FREQ(12,2)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(4,1))
#endif
#endif
#endif
#endif

// Try REFDIV=12, FLLD=4
#ifndef FLL_FLLD
#if(_CALC_FLLN(12, 4) <= 511)
#if(_CALC_FREQ(12,4) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(12,4) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(4,1)
#define FLL_FLLREFDIV    FLLREFDIV__4
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(4,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(12,4) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(12,4))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(4,1)
#define FLL_FLLREFDIV    FLLREFDIV__4
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(4,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(12,4))
#endif
#endif
#endif
#endif

// Try REFDIV=2, FLLD=1
#ifndef FLL_FLLD
#if(_CALC_FLLN(2, 1) <= 511)
#if(_CALC_FREQ(2,1) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(2,1) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,4)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__4
#define DCO_FREQ        _CALC_FREQ(12,4)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(2,1) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(2,1))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,4)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__4
#define DCO_FREQ        _CALC_FREQ(12,4)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(2,1))
#endif
#endif
#endif
#endif

// Try REFDIV=12, FLLD=8
#ifndef FLL_FLLD
#if(_CALC_FLLN(12, 8) <= 511)
#if(_CALC_FREQ(12,8) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(12,8) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(2,1)
#define FLL_FLLREFDIV    FLLREFDIV__2
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(2,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(12,8) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(12,8))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(2,1)
#define FLL_FLLREFDIV    FLLREFDIV__2
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(2,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(12,8))
#endif
#endif
#endif
#endif

