Koryphon/msp430lib/modules/clock_sys_internal.h
// Try REFDIV=1, FLLD=1
#ifndef FLL_FLLD
#if(_CALC_FLLN(1, 1) <= 511)
#if(_CALC_FREQ(1,1) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(1,1) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,8)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__8
#define DCO_FREQ        _CALC_FREQ(12,8)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(1,1) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(1,1))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,8)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__8
#define DCO_FREQ        _CALC_FREQ(12,8)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(1,1))
#endif
#endif
#endif
#endif

// Try REFDIV=12, FLLD=16
#ifndef FLL_FLLD
#if(_CALC_FLLN(12, 16) <= 511)
#if(_CALC_FREQ(12,16) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(12,16) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,1)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(1,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(12,16) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(12,16))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,1)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__1
#define DCO_FREQ        _CALC_FREQ(1,1)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(12,16))
#endif
#endif
#endif
#endif

// Try REFDIV=1, FLLD=2
#ifndef FLL_FLLD
#if(_CALC_FLLN(1, 2) <= 511)
#if(_CALC_FREQ(1,2) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(1,2) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,16)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__16
#define DCO_FREQ        _CALC_FREQ(12,16)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(1,2) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(1,2))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,16)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__16
#define DCO_FREQ        _CALC_FREQ(12,16)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(1,2))
#endif
#endif
#endif
#endif

// Try REFDIV=12, FLLD=32
#ifndef FLL_FLLD
#if(_CALC_FLLN(12, 32) <= 511)
#if(_CALC_FREQ(12,32) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(12,32) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,2)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__2
#define DCO_FREQ        _CALC_FREQ(1,2)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(12,32) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(12,32))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,2)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__2
#define DCO_FREQ        _CALC_FREQ(1,2)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(12,32))
#endif
#endif
#endif
#endif

// Try REFDIV=1, FLLD=4
#ifndef FLL_FLLD
#if(_CALC_FLLN(1, 4) <= 511)
#if(_CALC_FREQ(1,4) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(1,4) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,32)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__32
#define DCO_FREQ        _CALC_FREQ(12,32)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(1,4) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(1,4))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(12,32)
#define FLL_FLLREFDIV    FLLREFDIV__12
#define FLL_FLLD        FLLD__32
#define DCO_FREQ        _CALC_FREQ(12,32)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(1,4))
#endif
#endif
#endif
#endif

// Try REFDIV=1, FLLD=8
#ifndef FLL_FLLD
#if(_CALC_FLLN(1, 8) <= 511)
#if(_CALC_FREQ(1,8) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(1,8) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,4)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__4
#define DCO_FREQ        _CALC_FREQ(1,4)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(1,8) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(1,8))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,4)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__4
#define DCO_FREQ        _CALC_FREQ(1,4)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(1,8))
#endif
#endif
#endif
#endif

// Try REFDIV=1, FLLD=16
#ifndef FLL_FLLD
#if(_CALC_FLLN(1, 16) <= 511)
#if(_CALC_FREQ(1,16) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(1,16) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,8)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__8
#define DCO_FREQ        _CALC_FREQ(1,8)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (_CALC_FREQ(1,16) - TARGET_DCO_FREQ)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(1,16))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,8)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__8
#define DCO_FREQ        _CALC_FREQ(1,8)
#else // otherwise update the error
#undef FRQ_ERROR
#define FRQ_ERROR    (TARGET_DCO_FREQ - _CALC_FREQ(1,16))
#endif
#endif
#endif
#endif

