Koryphon/msp430lib/modules/clock_sys_internal.h
// Try REFDIV=1, FLLD=32
#ifndef FLL_FLLD
#if(_CALC_FLLN(1, 32) <= 511)
#if(_CALC_FREQ(1,32) > TARGET_DCO_FREQ) // if error is positive
#if(FRQ_ERROR < (_CALC_FREQ(1,32) - TARGET_DCO_FREQ)) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,16)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__16
#define DCO_FREQ        _CALC_FREQ(1,16)
#else // otherwise update the error
#define FLL_FLLN        _CALC_FLLN(1,32)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__32
#define DCO_FREQ        _CALC_FREQ(1,32)
#endif
#else // if error is negative
#if(FRQ_ERROR < (TARGET_DCO_FREQ - _CALC_FREQ(1,32))) // if prev error is better, use those values
#define FLL_FLLN        _CALC_FLLN(1,16)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__16
#define DCO_FREQ        _CALC_FREQ(1,16)
#else // otherwise update the error
#define FLL_FLLN        _CALC_FLLN(1,32)
#define FLL_FLLREFDIV    FLLREFDIV__1
#define FLL_FLLD        FLLD__32
#define DCO_FREQ        _CALC_FREQ(1,32)
#endif
#endif
#else
#error Desired target DCO frequency is out of feasible range!
#endif
#endif

#else //(MANUALLY_CONFIG_DCO != 0)

#define FLL_FLLD        MANUAL_FLLD
#define FLL_FLLN        MANUAL_FLLN

#if (MANUAL_FLLREFDIV == 0)
#define DCO_FREQ        (FLL_REF_FREQ * (FLL_FLLN+1) * (1 << FLL_FLLD))
#define FLL_FLLREFDIV    FLLREFDIV__1
#elif (MANUAL_FLLREFDIV == 1)
#define DCO_FREQ        ((FLL_REF_FREQ * (FLL_FLLN+1) * (1 << FLL_FLLD))/2)
#define FLL_FLLREFDIV    FLLREFDIV__2
#elif (MANUAL_FLLREFDIV == 2)
#define DCO_FREQ        ((FLL_REF_FREQ * (FLL_FLLN+1) * (1 << FLL_FLLD))/4)
#define FLL_FLLREFDIV    FLLREFDIV__4
#elif (MANUAL_FLLREFDIV == 3)
#define DCO_FREQ        ((FLL_REF_FREQ * (FLL_FLLN+1) * (1 << FLL_FLLD))/8)
#define FLL_FLLREFDIV    FLLREFDIV__8
#elif (MANUAL_FLLREFDIV == 4)
#define DCO_FREQ        ((FLL_REF_FREQ * (FLL_FLLN+1) * (1 << FLL_FLLD))/12)
#define FLL_FLLREFDIV    FLLREFDIV__12
#elif (MANUAL_FLLREFDIV == 5)
#define DCO_FREQ        ((FLL_REF_FREQ * (FLL_FLLN+1) * (1 << FLL_FLLD))/16)
#define FLL_FLLREFDIV    FLLREFDIV__16
#else
#error "Invalid MANUAL_FLLREFDIV"
#endif

#endif
#endif

//--------------------------------------------------------------------------------------------------

// ACLK
#if (ACLK_SRC == 0)
#define        _ACLK_FREQ        (DCO_FREQ >> ACLK_DIV)
#define        _SELA            SELA__DCOCLK
#elif (ACLK_SRC == 1)
#define        _ACLK_FREQ        (XT1_FREQ >> ACLK_DIV)
#define        _SELA            SELA__XT1CLK
#elif (ACLK_SRC == 2)
#define        _ACLK_FREQ        (XT2_FREQ >> ACLK_DIV)
#define        _SELA            SELA__XT2CLK
#elif (ACLK_SRC == 3)
#define        _ACLK_FREQ        ((10000L) >> ACLK_DIV)
#define        _SELA            SELA__VLOCLK
#elif (ACLK_SRC == 4)
#define        _ACLK_FREQ        ((32768L) >> ACLK_DIV)
#define        _SELA            SELA__REFOCLK
#else
#error "Invalid ACLK_SRC"
#endif

// SMCLK
#if (SMCLK_SRC == 0)
#define        _SMCLK_FREQ        (DCO_FREQ >> SMCLK_DIV)
#define        _SELS            SELS__DCOCLK
#elif (SMCLK_SRC == 1)
#define        _SMCLK_FREQ        (XT1_FREQ >> SMCLK_DIV)
#define        _SELS            SELS__XT1CLK
#elif (SMCLK_SRC == 2)
#define        _SMCLK_FREQ        (XT2_FREQ >> SMCLK_DIV)
#define        _SELS            SELS__XT2CLK
#elif (SMCLK_SRC == 3)
#define        _SMCLK_FREQ        ((10000L) >> SMCLK_DIV)
#define        _SELS            SELS__VLOCLK
#elif (SMCLK_SRC == 4)
#define        _SMCLK_FREQ        ((32768L) >> SMCLK_DIV)
#define        _SELS            SELS__REFOCLK
#else
#error "Invalid SMCLK_SRC"
#endif

// MCLK
#if (MCLK_SRC == 0)
#define        _MCLK_BASE_FREQ    DCO_FREQ
#define        _MCLK_FREQ        (DCO_FREQ >> (UCSCTL5 & 0x07))
#define        _SELM            SELM__DCOCLK
#elif (MCLK_SRC == 1)
#define        _MCLK_BASE_FREQ    XT1_FREQ
#define        _MCLK_FREQ        (XT1_FREQ >> (UCSCTL5 & 0x07))
#define        _SELM            SELM__XT1CLK
#elif (MCLK_SRC == 2)
#define        _MCLK_BASE_FREQ    XT2_FREQ
#define        _MCLK_FREQ        (XT2_FREQ >> (UCSCTL5 & 0x07))
#define        _SELM            SELM__XT2CLK
#elif (MCLK_SRC == 3)
#define        _MCLK_BASE_FREQ    (10000L)
#define        _MCLK_FREQ        ((10000L) >> (UCSCTL5 & 0x07))
#define        _SELM            SELM__VLOCLK
#elif (MCLK_SRC == 4)
#define        _MCLK_BASE_FREQ    (32768L)
#define        _MCLK_FREQ        ((32768L) >> (UCSCTL5 & 0x07))
#define        _SELM            SELM__REFOCLK
#else
#error "Invalid MCLK_SRC"
#endif

// XCAP calculation
#ifdef _USING_XT1
#if (XT1_FREQ < 40000L)
#define LFXT_REQUIRED_CAP    (20*LFXT_LOAD_CAP) // Includes pin cap. Ignores any trace cap.
// ^^ Multiplied by 10 to include tenths digit in calculation
// Typical 5xx and 6xx caps available:
//    XCAP_0 = 2.0
//    XCAP_1 = 5.5
//    XCAP_2 = 8.5
//    XCAP_3 = 12.0

// Midpoints derived from above:
//    3.75
//    7
//    10.25

#if (LFXT_REQUIRED_CAP <= 37)
#define XT1_XCAP    XCAP_0
#elif (LFXT_REQUIRED_CAP <= 70)
#define XT1_XCAP    XCAP_1
#elif (LFXT_REQUIRED_CAP <= 102)
#define XT1_XCAP    XCAP_2
#else
#define XT1_XCAP    XCAP_3
#endif

#endif
#endif

// Maximum system frequency
#if ((_ACLK_FREQ > _SMCLK_FREQ) && (_ACLK_FREQ > _MCLK_BASE_FREQ))
// ACLK is highest
#define _MAX_SYS_FREQ    _ACLK_FREQ
#elif ((_SMCLK_FREQ > _ACLK_FREQ) && (_SMCLK_FREQ > _MCLK_BASE_FREQ))
// SMCLK is highest
#define _MAX_SYS_FREQ    _SMCLK_FREQ
#else
// MCLK can be highest
#define _MAX_SYS_FREQ    _MCLK_BASE_FREQ
#endif

// cleanup
#ifndef XT1HFOFFG
#define XT1HFOFFG    0x0000
#endif

#ifndef XT2OFFG
#define XT2OFFG    0x0000
#endif

#define        _MCLK_MAXLEVEL    5

//--------------------------------------------------------------------------------------------------
#endif

//##################################################################################################
#endif
